app/controllers/beers_controller.rb

  def name
    begin
      @beer = Beer.find_by_name(params[:name])
---
SELECT "beers".* FROM "beers" WHERE "beers"."name" = $1 LIMIT $2  [["name", "IPA"], ["LIMIT", 1]]

  def create
    @beer = Beer.new(beer_params)

    if @beer.save
---
INSERT INTO "beers" ("name", "image", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "India Pale Ale"], ["image", "test"], ["rating", 5], ["created_at", "2019-09-12 19:52:10.048458"], ["updated_at", "2019-09-12 19:52:10.048458"]]

  def update
    if @beer.update(beer_params)
---
UPDATE "beers" SET "rating" = $1, "updated_at" = $2 WHERE "beers"."id" = $3  [["rating", "0"], ["updated_at", "2019-09-16 21:49:46.810377"], ["id", 10]]