app/controllers/favorites_controller.rb

      def show_favorites
        @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def favorites
        @user = User.find(params[:user_id])
        @beer = Beer.find(params[:beer_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]